a = int(input('Введите месяц в виде числа от 1 до 12: '))
while a < 1 or a > 12:
    print('Введено некорректное число! Попробуйте еще раз.')
    a = int(input('Введите месяц в виде числа от 1 до 12: '))
# через dict
calendar = {12: 'Зима', 1: 'Зима', 2: 'Зима', 3: 'Весна', 4: 'Весна', 5: 'Весна', 6: 'Лето', 7: 'Лето', 8: 'Лето', 9: 'Осень', 10: 'Осень', 11: 'Осень'}
print(calendar.get(a))
# через list
list = [None, 'Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
print(list[a])